app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'pedorro2'
OR `username` = 'pedorro2'
 LIMIT 1
---
    public function login()
    {
        $data = $this->request->getPost();

    $usuario = $this->usuarioModel->where('email', $data['email'])
                        ->orWhere('username', $data['email'])
                        ->first();