app/Controllers/AuthController.php

    public function login()
    {
        $data = $this->request->getPost();

        // Verificar si el usuario existe
        if (filter_var($data['email'], FILTER_VALIDATE_EMAIL)) {
            $usuario = $this->usuarioModel->where('email', $data['email'])->first();
        } else {
            $usuario = $this->usuarioModel->where('username', $data['email'])->first();
        }
        if (!$usuario) {
            return redirect()->to('/auth/login')->with('error', 'El correo electrónico o nombre de usuario no está registrado.');
        }
        // Verificar la contraseña
        if (!password_verify($data['password'], $usuario['password'])) {
            return redirect()->to('/auth/login')->with('error', 'Contraseña incorrecta.');
        }
        // Iniciar sesión
        $session = session();
        $session->set('usuario_id', $usuario['id']);
        $session->set('nombre', $usuario['nombre']);
        $session->set('username', $usuario['username']);
        $session->set('email', $usuario['email']);
        $session->set('rol', $usuario['rol']);
        return redirect()->to('/')->with('message', 'Bienvenido, ' . $usuario['nombre'] . '!');
---
SELECT *
FROM `usuarios`
WHERE `email` = 'enzorodriguez.078@gmail.com'
 LIMIT 1
SELECT *
FROM `usuarios`
WHERE `email` = 'pedorro2'
OR `username` = 'pedorro2'
 LIMIT 1