app/Controllers/DashboardController.php

SELECT *
FROM `tareas`
WHERE `id_usuario` = '4'
AND `archivada` = 0
---
    public function index()
{
    if (!session()->get('loggedIn')) {
        return redirect()->to('/auth/login');
    }

    $filter = $this->request->getGet('filter');
    $userId = session()->get('id');

    // Consulta CORREGIDA (usar id_usuario en lugar de id)
    $query = $this->tareaModel->where('id_usuario', $userId);

    switch ($filter) {
        case 'completed':
            $query->where('estado', 'completada');
            $active_filter = 'completed';
            break;
        case 'assigned':
            $query->where('asignada_por IS NOT NULL');
            $active_filter = 'assigned';
            break;
        case 'archived':
            $query->where('archivada', 1);
            $active_filter = 'archived';
            break;
        default:
        $query->where('archivada', 0);
        $active_filter = null;
    }

    $tareas = $query->findAll();

SELECT *
FROM `subtareas`
WHERE `id_tarea` = '17'
---
    public function verTarea($id)
    {
        $tarea = $this->tareaModel->find($id);
        $subtareas = $this->subTareaModel->where('id_tarea', $id)->findAll();