app/Controllers/SubTareaController.php

SELECT *
FROM `subtareas`
---
    public function index()
    {
        $subtareas = $this->subTareaModel->findAll();

INSERT INTO `subtareas` (`id_tarea`, `asunto`, `descripcion`, `prioridad`, `id_responsable`, `asignado_es_admin`, `estado`, `fecha_vencimiento`, `created_at`, `updated_at`) VALUES ('18', 'asd', 'asd', 'Normal', '4', 1, 'En proceso', '2025-05-14', '2025-05-16 13:03:06', '2025-05-16 13:03:06')
SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '18'
---

        log_message('info', 'Datos a insertar: ' . json_encode($dataSubtarea));

        if (!$this->subTareaModel->insert($dataSubtarea)) {
            throw new \RuntimeException('Error al insertar: ' . implode(', ', $this->subTareaModel->errors()));
        }

        $tarea = $this->tareaModel->find($tareaId);

SELECT *
FROM `subtareas`
WHERE `subtareas`.`id` = '37'
SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '21'
UPDATE `subtareas` SET `asunto` = 'asd', `descripcion` = 'asd', `prioridad` = 'Alta', `estado` = 'En proceso', `fecha_vencimiento` = '2025-05-21', `id_responsable` = '4', `asignado_es_admin` = '1', `updated_at` = '2025-05-16 20:42:10'
WHERE `subtareas`.`id` IN ('37')
SELECT *
FROM `subtareas`
WHERE `id_tarea` = '21'
---
    public function update($id = null)
    {
        $data = $this->request->getPost();
        $subtarea = $this->subTareaModel->find($id);

        if (!$subtarea) {
            return redirect()->back()->with('error', 'Subtarea no encontrada');
        }

        $tarea = $this->tareaModel->find($subtarea['id_tarea']);
        $usuarioId = session()->get('id');
        $rol = session()->get('rol');

        if ($tarea['archivada'] || $tarea['estado'] === 'Completada') {
            if ($usuarioId != $tarea['id_usuario'] && $rol != 'admin') {
                return redirect()->back()->with('error', 'No puedes editar subtareas de tareas archivadas o completadas');
            }
        }

         if (!$this->subTareaModel->update($id, $data)) {
            return redirect()->back()->withInput()->with('errors', $this->subTareaModel->errors());
        }

        $idTarea = $subtarea['id_tarea'];
    $todasSubtareas = $this->subTareaModel->where('id_tarea', $idTarea)->findAll();
    $tarea = $this->tareaModel->find($idTarea);