app/Controllers/TareaController.php

SELECT `tareas`.*, `usuarios`.`username` as `usuario_nombre`
FROM `tareas`
JOIN `usuarios` ON `usuarios`.`id` = `tareas`.`id_usuario`
WHERE `tareas`.`id` = '18'
SELECT *
FROM `usuarios`
SELECT `subtareas`.*, `usuarios`.`username` as `responsable_nombre`
FROM `subtareas`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `subtareas`.`id_responsable`
WHERE `id_tarea` = '18'
ORDER BY `created_at` DESC
---
    public function ver($id, $fromSubtarea = false)
{
    $tareaModel = model('TareaModel');
    $subTareaModel = model('SubtareaModel');

    if (!$tareaModel->puedeEditarTarea($id, session()->get('id'))) {
        return redirect()->to('/dashboard')->with('error', 'No tienes permiso para ver esta tarea o la tarea no existe');
    }

    if ($fromSubtarea) {
        $subtarea = $subTareaModel->find($id);
        if (!$subtarea) {
            return redirect()->to('/dashboard')->with('error', 'Subtarea no encontrada');
        }
        $id = $subtarea['id_tarea'];
    }

    if (!$tareaModel->puedeEditarTarea($id, session()->get('id'))) {
        return redirect()->to('/dashboard')->with('error', 'No tienes permiso para ver esta tarea');
    }

    $tarea = $tareaModel->select('tareas.*, usuarios.username as usuario_nombre')
                       ->join('usuarios', 'usuarios.id = tareas.id_usuario')
                       ->find($id);

    if (!$tarea) {
        return redirect()->to('/dashboard')->with('error', 'Tarea no encontrada');
    }

    $subtareas = $subTareaModel->select('subtareas.*, usuarios.username as responsable_nombre')
                              ->join('usuarios', 'usuarios.id = subtareas.id_responsable', 'left')
                              ->where('id_tarea', $id)
                              ->orderBy('created_at', 'DESC')
                              ->findAll();