app/Models/TareaModel.php

    public function getTareasByUserId($usuarioId)
    {
        return $this->where('id', $usuarioId)->findAll();
---
SELECT *
FROM `tareas`
WHERE `id` IS NULL